<script setup>
import AuthenticatedLayout from '@/Layouts/AuthenticatedLayout.vue';
import {Head} from '@inertiajs/vue3';
import Elink from "@/Components/Elink.vue";
</script>

<template>
    <Head title="Как улучшить роял квест?"/>

    <AuthenticatedLayout>
        <template #header>
            <h1
                class="text-xl font-semibold leading-tight text-gray-200"
            >
                Как улучшить роял квест?
            </h1>
        </template>

        <div class="py-12">
            <div class="mx-auto max-w-7xl sm:px-6 lg:px-8">
                <div
                    class="overflow-hidden bg-gray-800 shadow-sm sm:rounded-lg"
                >
                    <div class="p-6 text-gray-100 space-y-6">
                        <!-- Intro Section -->
                        <div class="prose prose-invert max-w-none">
                            <p>
                                Привет! Я решил сделать эту страницу, в надежде, что её посмотрит хотя бы один человек,
                                который может повлиять на разработку Royal Quest. Я постараюсь расписать все нюансы,
                                которые помогут улучшить игру комплексно. Эти рекомендации рассчитаны на то, чтобы
                                игроки получали лучший экспириенс от игры, продолжали играть, приглашали друзей
                                и начинали донатить и поддерживать разработчиков. А чем больше денег приносит игра,
                                тем больше обновлений она может выпускать
                            </p>
                            <p class="mt-4">
                                Рекомендации будут разделены на две группы PVP и PVE. Так же я постараюсь отсортировать
                                их, чтобы сначала шли изменения которые легко внедрить и они уже принесут профит, а
                                потом те, которые потребуют больше усилий. И так, погнали!
                            </p>
                        </div>
                        <div>
                            <p>
                                Перед тем как начать, я бы хотел сказать, что основную прибыль игре приносят взрослая
                                аудитория. Люди которые работают и имеют возможность вкинуть в игру много денег. Я бы
                                хотел
                                рассказать свою историю как я закинул в игру <span class="text-green-600 font-bold">400к рублей</span>.
                                И похожий путь прошёл не только я, но и многие другие игроки.
                            </p>
                            <h4>Глава I - Начало</h4>
                            <p>
                                Я несколько раз начинал играть и бросал. Первый мой вход в игру был ещё очень давно,
                                тогда ещё не было 65 уровней. Мне очень понравились механики, расслабляющая атмосфера и
                                сама игра. Но докачавшись до 44 уровня я столкнулся с барьером, что квестов почти нет,
                                качаться слишком трудно... И я забросил.
                            </p>
                            <h4>Глава II - Манящая сладость</h4>
                            <p>
                                Такое повторилось пару раз, но в итоге я вернулся в игру и взял заветный 65 лвл. По
                                началу фармить и выполнять задания без хороших шмоток было тяжело, но
                                <span class="font-bold">Я МОГ ЭТО ДЕЛАТЬ</span>.
                                И вот тут очень важный момент. Я понимал, что могу провести много времени за однотипным
                                фармом, либо закинуть немного денег и перейти к следующему контенту. Именно чувство, что
                                я могу сделать это обеими путями смотивировало меня это сделать. Если бы я понимал, что
                                без доната это почти нереально, то я бы бросил игру с мыслью "донатная помойка". И шло
                                время, я продолжал играть, и в моментах, когда мне надоедал однотипный контент,
                                однотипный фарм, я просто донатил, чтобы скорее приблизиться к следующему контенту.
                                И это развивало привычку донатить. В какой-то момент, я достиг шмота, чтобы проходить
                                все данжи (48 ГПД, Соло) и уже готов был удалять игру, ведь больше чем +7 шмот не нужен.
                                Да я буду сильнее, но это не позволит мне увидеть какой-то новый контент. Но я попал в
                                гильдию, где ребята бегали арены и им нужен был напарник. Я понимал, что могу бегать 48
                                в течении несколько месяцев, либо я могу закинуть 100к рублей и сделать себе шмот. Так я
                                и поступил. Сначала закинул 10к, мы много проигрывали, потом ещё 10, потом ещё 10, и так
                                пока не начались победы. Единственный контент который оставался - это мировые боссы и
                                осады. Меня сильно удерживала в игре <span class="text-red-700 font-bold">Гильдия</span>.
                                И это ключевой фактор. Большинство игроков до сих пор играет, потому что их удерживает
                                коллектив. Этот же коллектив меня втянул сначала как бафера на мировых боссов, а потом
                                я сделал сина, на которого надо было делать 6 пар профилек под каждого босса. Выбил пару
                                карт мировых босов. Вступил в Dead Inside в надежде на новый контент, но из за того что
                                других гильдий конкурентов не было, это было очень скучно. Контент кончился - и я ушёл
                                из игры. Под старт нового сервера (Игниса), я вернулся и задонатил
                                <span class="text-green-600 font-bold">200к</span>. Третий по счёту на сервере взял 65
                                и поиграв немного, понял, что для меня нет нового контента и ушёл.
                            </p>
                            <h4>Глава III - Барьер</h4>
                            <p>
                                Под ребаланс крестоносца я решил - вот он! Новый контент! Вернулся в игру, пособирал лён
                                в Элгоре и пофармил хитиновые пластины, купил кач до 40 уровня, постоял афк на троллях и
                                клешнегрызах до 65. Таким образом за неделю, без доната и почти не играя, я апнул 65
                                лвл. Дальше я сделал пару цепочек и мне хватило денег, чтобы сделать +5-7 шмот без
                                слотов на кресте. И его уже было достаточно, чтобы бегать 48 ГПД в 3ДД.
                                В гайде на
                                <elink :href="route('guides.crusader')">
                                    Крестоносца
                                </elink>
                                я рассказал как. И всё? Граница входа в PVP контент и контент с мировыми боссами слишком
                                далека, потому что у всех есть карты боссов (эдварды, звероморы и так далее). Из за цен
                                на трофеи нету смысла качаться самому, куда выгоднее купить кач. В итоге весь контент в
                                игре доступный без доната - пройден за 2-3 недели. Я не могу пойти в PVP, потому что
                                порог входа слишком высокий. А весь контент PVE кроме мировых боссов уже пройден
                            </p>
                            <h4>Глава IV - Истина</h4>
                            <p>
                                Если бы трофеи из локаций до 60 уровня нужны были бы в крафте high lvl шмота,
                                возросло бы желание самостоятельно качаться, а не стоять афк на каче. Если бы порог
                                входа в PVP был бы более постепенным, то было бы больше желание в это втягиваться. Если
                                была бы возможность поучаствовать в осаде даже небольшой гильдией... Но сейчас весь
                                контент проходиться с полного нуля за пару недель без доната. А вход в PVP ? Либо
                                фармишь пол года, либо донатишь сразу минимум 100к. Хочешь походить на мировых боссов?
                                Закинь 500к и купи карту Зверомора.
                            </p>
                            <h4>Глава V - Хейт</h4>
                            <p>
                                Да, безусловно, что в игру приходят новички, они качаются, для них какой-то контент
                                новый. Но важно принять во внимание, что огромный % дохода приносят именно те, у кого
                                есть работа в жизни, и они хотят сохранить своё время на однотипном фарме. А новички
                                слышат от старичков, что ничего не меняется и стоит бросать игру...
                            </p>
                            <div>
                                Так вот! Вы сделали ОЧЕНЬ МНОГО БЕСПОЛЕЗНОГО ХЛАМА:
                                <ul>
                                    <li>Зибо - бесполезная карта, которая никому не нужна</li>
                                    <li>Поиск группы - в этом вообще не было смысла. Он никому не нужен</li>
                                    <li>
                                        Справочник для новичков - Серьёзно? У меня общался с 4 людьми которые начали
                                        играть и они его ни разу не открыли даже! Куда комфортнее прочитать гайд в
                                        интернете, или посмотреть видео на ютубе, чем искать в каком-то справочнике. Так
                                        устроенны MMORPG, что тебе приходиться гуглить. И это - нормально
                                    </li>
                                </ul>
                            </div>
                            <p>
                                Ещё раз. Обратите внимание. Ваша задача - сделать более плавный порог входа в любые
                                активности, а так же ввести контент, который смотивирует игроков возвращаться
                            </p>
                        </div>

                        <!-- PVP Section -->
                        <div id="PVP" class="pt-4 border-t border-gray-700">
                            <h4 class="text-lg font-semibold text-yellow-500 mb-4">
                                Как улучшить PVP ?
                            </h4>

                            <div class="space-y-6">
                                <!-- Арены блок -->
                                <div class="bg-gray-700/30 rounded-lg p-5">
                                    <h5 class="text-md font-medium text-yellow-400 mb-2">1. Увеличение количества
                                        арен</h5>
                                    <p class="mb-3">
                                        Самое просто что можно сделать - это увеличить количество бесплатных арен.
                                        Сейчас их 5, а
                                        можно сделать к примеру 30. Либо можно увеличить скорость их "восстановления".
                                        Чтобы каждые
                                        несколько минут игры у тебя появлялась арена.
                                    </p>
                                    <p class="mb-2 font-medium">Зачем это нужно?</p>
                                    <p>
                                        Это увеличит количество людей, которые в данный момент находятся в очереди на
                                        арену. В игре уже есть система
                                        подбора, которая старается более слабые пачки попадаться против таких же слабых
                                        пачек.
                                        Но к сожалению, в очереди на арену почти всегда мало людей. Поэтому не важно кто
                                        ты,
                                        тебе всегда попадутся те, кто сейчас встал в поиск. Как правило ты в условном +9
                                        шмоте,
                                        умираешь от одного удара фулл одетого +11 форжа с картами боссов. И порог входа
                                        очень
                                        высокий. Если ты хочешь играть в PVP, то тебе нужно сделать фулл +11 шмот, с
                                        рыжими
                                        печатями, а так же устроить "переливы", специально проигрывая 1000 арен.
                                    </p>
                                    <p class="mt-3">
                                        Если же мы увеличим количество доступных арен, то в очереди станет больше людей,
                                        рейтинг будет больше влиять.
                                        И даже если ты +7 и только начал пробовать себя в PVP, ты уже сможешь
                                        заинтересоваться в
                                        этом. И это будет работать как наркотик. У тебя будет желание стать сильнее и
                                        сильнее.
                                        Что как раз увеличит кол-во донатов в игру. Сейчас очень многие люди даже
                                        не пробуют себя в PVP. Потому что порог входа очень высокий
                                    </p>
                                </div>

                                <!-- PVP карты блок -->
                                <div class="bg-gray-700/30 rounded-lg p-5">
                                    <h5 class="text-md font-medium text-yellow-400 mb-2">2. Новые PVP карты</h5>
                                    <p class="mb-3">
                                        Представим мы уже увеличили количество доступных арен. Но нужно найти способ ещё
                                        завлечь
                                        людей, чтобы они начали регать эти арены. Для этого можно сделать пару простых
                                        PVP карт,
                                        которые будут лучше уже существующих PVE карт.
                                    </p>
                                    <ul class="list-disc list-inside space-y-2 ml-4">
                                        <li>
                                            Для танков можно добавить карту на 8% дефа, которая вставляется в артефакт и
                                            является более крутым аналогом карты
                                            <elink href="https://royalquest.info/ru/Карта_Пещерного_гнусмаса">Пещерного
                                                гнусмаса
                                            </elink>
                                        </li>
                                        <li>
                                            Добавить пару карт которые будут слабее существующих, но при этом будут
                                            являться бюджетной заменой уже существующих карт.
                                            Например сделать аналог карты
                                            <elink href="https://royalquest.info/ru/Карта_Гранита_истины">Гранита
                                                истины
                                            </elink>
                                            который будет давать "+4 к ловкости и +1 к восстановлению энергии"
                                        </li>
                                    </ul>
                                    <p class="mt-2">
                                        К этим картам можно так же добавить какие-то незначительные PVP статы
                                    </p>
                                </div>

                                <!-- Арены 2х2 и 4х4 блок -->
                                <div class="bg-gray-700/30 rounded-lg p-5">
                                    <h5 class="text-md font-medium text-yellow-400 mb-2">3. Добавление арен 2х2 и
                                        4х4</h5>
                                    <p class="mb-3">
                                        Число доступных арен (или сокращение времени их накопления) добавляются очень
                                        просто, как
                                        и добавление новых карт крови. Теперь перейдём к немного более сложной механике.
                                        Это
                                        добавление арен 2х2 и 4х4.
                                    </p>

                                    <div class="mb-4">
                                        <p class="font-medium">Проблема бесконечных арен:</p>
                                        <p class="mt-1">
                                            Перед тем как продолжу, хочу вставить, что в игре есть неприятная
                                            механика как "бесконечные арены". Когда не одна пачка не может пробить
                                            другую.
                                        </p>
                                        <p class="mt-2 font-medium">Как исправить:</p>
                                        <ul class="list-disc list-inside ml-4 mt-1">
                                            <li>Нужно спустя какое-то время (к примеру 4-5 минут), увеличить количество
                                                возможных накладываемых стаков душителя
                                            </li>
                                            <li>Либо можно сделать стаки душителя менее эффективными, но чтобы они
                                                держались дольше на цели
                                            </li>
                                        </ul>
                                        <p class="mt-2">Таким образом арена рано или поздно закончится, когда хилл
                                            упадёт в 0.</p>
                                    </div>

                                    <div>
                                        <p class="font-medium">Решение проблемы очередей:</p>
                                        <ul class="list-disc list-inside ml-4 mt-1 mb-3">
                                            <li>Добавляем кнопку "встать во все очереди"</li>
                                            <li>Отображать, сколько людей на данный момент в очереди (есть и другие
                                                способы, но думаю не стоит их расписывать)
                                            </li>
                                        </ul>

                                        <p class="font-medium">Как это может увеличить прибыль?</p>
                                        <ul class="list-disc list-inside ml-4 mt-1">
                                            <li>Сильно дополняет первые два фактора</li>
                                            <li>Билды и шмот под эти режимы будут отличаться, что смотивирует БОГАТЫХ
                                                ИГРОКОВ, которые и так вкидывают в игру кучу денег, делать новые
                                                "свапы", которые больше заточены под другие режимы
                                            </li>
                                            <li>Можно сделать так, чтобы эти арены 4х4 или 2х2, были доступны только за
                                                билеты. Что позволит не потерять старый доход с билетов на арену
                                            </li>
                                        </ul>
                                    </div>
                                </div>

                                <!-- Другие режимы -->
                                <div class="bg-gray-700/30 rounded-lg p-5">
                                    <h5 class="text-md font-medium text-yellow-400 mb-2">4. Другие PVP режимы</h5>
                                    <p class="mb-3">
                                        Только после того как мы увеличили количество людей которым интересно PVP, стоит
                                        взглянуть
                                        на другие режимы. А точнее поле боя, осады, аркон и война гильдий. А так же
                                        возможно
                                        обратить внимание на PVP локации.
                                    </p>
                                    <p>
                                        Есть очень много "предложений", которые так же улучшат
                                        игровой экспиренс и потенциально увеличат доход разработчиков. Но они требуют
                                        немного больше усилий со стороны разработки, а так же для них желательно сначала
                                        увеличить количество игроков, вовлечённых в PVP. Мне очень нравится
                                        <elink href="https://www.youtube.com/watch?v=pn-olmN63zs">ролик</elink>
                                        который сделал Kymikoha (глава гильдии Dead Inside). Я не вижу особо смысла
                                        расписывать
                                        дальше про PVP, пока не будут внесены хотя бы минимальный простые изменения.
                                    </p>
                                </div>
                                <!-- Архив -->
                                <div>
                                    <p class="font-medium">123</p>
                                </div>
                            </div>
                        </div>

                        <!-- PVE Section -->
                        <div id="PVE" class="pt-4 border-t border-gray-700">
                            <h4 class="text-lg font-semibold text-yellow-500 mb-4">
                                Как улучшить PVE ?
                            </h4>
                            <div class="bg-gray-700/30 rounded-lg p-5 text-center text-gray-400 italic">
                                <p>Напишу позже...</p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </AuthenticatedLayout>
</template>
