<script setup>
import AuthenticatedLayout from '@/Layouts/AuthenticatedLayout.vue';
import {Head, Link} from '@inertiajs/vue3';
import Elink from "@/Components/Elink.vue";
</script>

<template>
    <Head title="Как улучшить роял квест?"/>

    <AuthenticatedLayout>
        <template #header>
            <h1
                class="text-xl font-semibold leading-tight text-gray-200"
            >
                Как улучшить роял квест?
            </h1>
        </template>

        <div class="py-12">
            <div class="mx-auto max-w-7xl sm:px-6 lg:px-8">
                <div
                    class="overflow-hidden bg-gray-800 shadow-sm sm:rounded-lg"
                >
                    <div class="p-6 text-gray-100">
                        <p>
                            Привет! Я решил сделать эту страницу, в надежде, что её посмотрит хотя бы один человек,
                            который может повлиять на разработку Royal Quest. Я постараюсь расписать все нюансы,
                            которые помогут улучшить игру комплексно. Эти рекомендации рассчитаны на то, чтобы
                            игроки получали лучший экспириенс от игры, продолжали играть, приглашали друзей
                            и начинали донатить и поддерживать разработчиков. А чем больше денег приносит игра,
                            тем больше обновлений она может выпускать
                        </p>
                        <p class="mt-4">
                            Рекомендации будут разделены на две группы PVP и PVE. Так же я постараюсь отсортировать их,
                            чтобы сначала шли изменения которые легко внедрить и они уже принесут профит, а потом те,
                            которые потребуют больше усилий. И так, погнали!
                        </p>
                    </div>
                    <div id="PVP" class="p-6 text-gray-100">
                        <h4>
                            Как улучшить PVP ?
                        </h4>
                        <p>
                            Самое просто что можно сделать - это увеличить количество бесплатных арен. Сейчас их 5, а
                            можно сделать к примеру 30. Либо можно увеличить скорость их "восстановления". Чтобы каждые
                            несколько минут игры у тебя появлялась арена. Зачем это нужно? Это увеличит количество
                            людей, которые в данный момент находятся в очереди на арену. В игре уже есть система
                            подбора, которая старается более слабые пачки попадаться против таких же слабых пачек.
                            Но к сожалению, в очереди на арену почти всегда мало людей. Поэтому не важно кто ты,
                            тебе всегда попадутся те, кто сейчас встал в поиск. Как правило ты в условном +9 шмоте,
                            умираешь от одного удара фулл одетого +11 форжа с картами боссов. И порог входа очень
                            высокий. Если ты хочешь играть в PVP, то тебе нужно сделать фулл +11 шмот, с рыжими
                            печатями, а так же устроить "переливы", специально проигрывая 1000 арен. Если же мы увеличим
                            количество доступных арен, то в очереди станет больше людей, рейтинг будет больше влиять.
                            И даже если ты +7 и только начал пробовать себя в PVP, ты уже сможешь заинтересоваться в
                            этом. И это будет работать как наркотик. У тебя будет желание стать сильнее и сильнее.
                            Что как раз увеличит кол-во донатов в игру. Сейчас очень многие люди даже
                            не пробуют себя в PVP. Потому что порог входа очень высокий
                        </p>
                        <p>
                            Представим мы уже увеличили количество доступных арен. Но нужно найти способ ещё завлечь
                            людей, чтобы они начали регать эти арены. Для этого можно сделать пару простых PVP карт,
                            которые будут лучше уже существующих PVE карт. Например для танков можно добавить карту,
                            на 8% дефа, которая вставляется в артефакт и является более крутым аналогом карты
                            <elink href="https://royalquest.info/ru/Карта_Пещерного_гнусмаса">Пещерного гнусмаса</elink>
                            .
                            Или можно добавить пару карт которые будут слабее существующих, но при этом будут
                            являться бюджетной заменой уже существующих карт. Например сделать аналог карты
                            <elink href="https://royalquest.info/ru/Карта_Гранита_истины">Гранита истины</elink>
                            который будет давать "+4 к ловкость и +1 к восстановлению энергии".
                            К этим картам можно так же добавить какие-то незначительные PVP статы
                        </p>
                        <p>
                            Число доступных арен (или сокращение времени их накопления) добавляются очень просто, как
                            и добавление новых карт крови. Теперь перейдём к немного более сложной механике. Это
                            добавление арен 2х2 и 4х4. Перед тем как продолжу, хочу вставить, что в игре есть неприятная
                            механика как "бесконечные арены". Когда не одна пачка не может пробить другую. Исправляется
                            это тоже довольно не сложно. Нужно спустя какое-то время (к примеру 4-5 минут), увеличить
                            количество возможных накладываемых стаков душителя. Либо можно сделать стаки душителя менее
                            эффективными, но чтобы они держались дольше на цели. Таким образом арена рано или поздно
                            закончится, когда хилл упадёт в 0. Добавляя очереди 2х2 и 4х4, у нас возникает старая
                            проблема с тем, что в очереди может не хватать людей. Фиксится она довольно не сложно.
                            Во первых мы добавляем кнопку "встать во все очереди". А во вторых, можно отображать,
                            сколько людей на данный момент в очереди(есть и другие способы, но думаю не стоит их
                            расписывать). А теперь главное, как это может увеличить прибыль? Во первых это сильно
                            дополняет первые два фактора. Во вторых, билды и шмот под эти режимы будут отличаться,
                            что смотивирует БОГАТЫХ ИГРОКОВ, которые и так вкидывают в игру кучу денег, делать
                            новые "свапы", которые больше заточены под другие режимы. Мы так же можем сделать так,
                            чтобы эти арены 4х4 или 2х2, были доступны только за билеты. Что позволит не потерять
                            старый доход с билетов на арену
                        </p>
                        <p>
                            Только после того как мы увеличили количество людей которым интересно PVP, стоит взглянуть
                            на другие режимы. А точнее поле боя, осады, аркон и война гильдий. А так же возможно
                            обратить внимание на PVP локации. Есть очень много "предложений", которые так же улучшат
                            игровой экспиренс и потенциально увеличат доход разработчиков. Но они требуют
                            немного больше усилий со стороны разработки, а так же для них желательно сначала
                            увеличить количество игроков, вовлечённых в PVP. Мне очень нравится
                            <elink href="https://www.youtube.com/watch?v=pn-olmN63zs">ролик</elink>
                            который сделал Kymikoha(глава гильдии Dead Inside). Я не вижу особо смысла расписывать
                            дальше про PVP, пока не будут внесены хотя бы минимальный простые изменения. Поэтому
                            переходим к PVE
                        </p>
                    </div>
                    <div id="PVE">
                        <h4>
                            Как улучшить PVE ?
                        </h4>
                        <p>
                            Напишу позже...
                        </p>
                    </div>
                </div>
            </div>
        </div>
    </AuthenticatedLayout>
</template>
